"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""

EXAMPLE = []

for i in range(1, 5):
    row = []
    summ = 0

    for j in range(1, 5):
        value = int(input(f'String {i}, column {j}: '))
        summ += value
        row.append(value)
    row.append(summ)
    EXAMPLE.append(row)

for line in EXAMPLE:
    for item in line:
        print(f'{item:>5}', end="")
    print()
