"""
Задание_3.	В массиве случайных целых чисел поменять
местами минимальный и максимальный элементы.

Пример:
В данном массиве чисел максимальное число   88 стоит на
0 позиции, а минимальное число  -49 стоит на    6 позиции
Заменяем их
[88, 26, 41, 75, 23, 52, -49, 60, 69, -18]
В данном массиве чисел максимальное число   88 стоит на
6 позиции, а минимальное число  -49 стоит на    0 позиции
[-49, 26, 41, 75, 23, 52, 88, 60, 69, -18]
"""


a = [88, 26, 41, 75, 23, 52, -49, 60, 69, -18]
maximum = a.index(max(a))
minimum = a.index(min(a))
print(maximum)
print(minimum)
a[0], a[6] = a[6], a[0]
print(a)