"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""

from functools import reduce

ROW = 5
COL = 4
a = []
for i in range(1, ROW + 1):
    print(f'{i}-я строка')
    items = [int(input()) for _ in range(0, COL)]
    items.append(reduce(lambda x, y: x + y, items))
    a.append(items)
for i in a:
    print(i)
