"""
Задание_5.	В массиве найти максимальный отрицательный элемент.
Вывести на экран его значение и позицию (индекс) в массиве.

Подсказка: максимальный отрицательный - элемент, наиболее близкий к нулю

Пример:
Базовый список: [-55, -69, -5, 72, -41, -58, -79, 58, 74, 1]
Максимальный отрицательный элемент в данном массиве = -5, его индекс 2
"""
from random import randint

LIST = [randint(-100, 100) for i in range(20)]
MAX_NEGATIVE = max([itm for itm in LIST if itm < 0])
print(LIST)
print(MAX_NEGATIVE)
