"""
Задание_2. Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.

Подсказка:
Попробуйте решить эту задачу в одну строку (такое решение точно есть)

Пример:
Исходный массив: [8, 3, 15, 6, 4, 2], результат: [0, 3, 4, 5]
"""

LIST_1 = [8, 3, 15, 6, 4, 2]
LIST_2 = []
RESULT = [LIST_2.append(i) for i, x in enumerate(LIST_1) if not x % 2]

print(f"Исходный массив: {LIST_1}, результат: {LIST_2}")
