"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""


def matrix_input():
    my_matrix = []
    for i in range(5):
        spam = [int(input('введите число: ')) for i in range(4)]
        spam.append(sum(spam))
        my_matrix.append(spam)
    return "\n".join([f"{my_matrix[i]}" for i in range(0, len(my_matrix))])


MATRIX = matrix_input()
print(MATRIX)