"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""
MATRIX = []
for i in range(5):
    stroke = []
    for j in range(5):
        if j == 4:
           stroke.append(sum(stroke))
           break
        num = int(input(f'Введите {j+1} элемент {i+1} строки: '))
        stroke.append(num)
    MATRIX.append(stroke)
for el in MATRIX:
    print(el)
