"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""

USER_MATRIX = []


for i in range(5):
    row = []
    for j in range(4):
        row.append(int(input(f"Введите {j + 1} элемент {i + 1} строки: ")))
    USER_MATRIX.append(row)


for i in USER_MATRIX:
    i.append(sum(i))


for i in USER_MATRIX:
    print(i)
