"""
Задание_7.	В одномерном массиве целых чисел определить два наименьших элемента.
Они могут быть как равны между собой (оба являться минимальными), так и различаться.

Пример:
Исходный массив: [28, -86, 44, -37, -7, -52, -19, -3, -15, -73]
Наименьший элемент: -86, встречается в этом массиве 1 раз
Второй наименьший элемент: -73
"""
arr = [28, -86, 44, -37, -7, -52, -19, -3, -15, -73]
N = arr.count(min(arr))
print(f' Исходный массив: {arr} \n Наименьший элемент: {min(arr)}, встречается в этом массиве {N} раз')
if N < 2:
    arr1 = arr[:]
    arr1.remove(min(arr))
    print(f' Второй наименьший элемент: {min(arr1)}')