"""
Задание_2. Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.

Подсказка:
Попробуйте решить эту задачу в одну строку (такое решение точно есть)

Пример:
Исходный массив: [8, 3, 15, 6, 4, 2], результат: [0, 3, 4, 5]
"""
default_arr = [2, 5, 8, 15, 13, 27, 28, 40, 54, 65, 78, 13]
equals_arr = []

for el in default_arr:
    if el % 2 == 0:
        equals_arr.append(default_arr.index(el) + 1)
print(equals_arr)
