"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""
my_arr = []
for i in range(5):
    my_arr.append([])
    s = 0
    for j in range(4):
        n = int(input(f"Введите {j + 1} число строки: "))
        s +=n
        my_arr[-1].append(n)
    my_arr[-1].append(s)
for i in my_arr:
    print(i)
