"""
Задание_2. Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.

Подсказка:
Попробуйте решить эту задачу в одну строку (такое решение точно есть)

Пример:
Исходный массив: [8, 3, 15, 6, 4, 2], результат: [0, 3, 4, 5]
"""
NUMBER_LIST = [8, 3, 15, 6, 4, 2]
EVEN_LIST = []

for i, el in enumerate(NUMBER_LIST):
    if el % 2 == 0:
        EVEN_LIST.append(i)
print(EVEN_LIST)

# Вот так в одну строку
EVEN_LIST2 = [i for i, el in enumerate(NUMBER_LIST) if el % 2 == 0]
print(EVEN_LIST2)
