"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Постарайтесь решить задачу двумя способами:
1. Через цикл
Вариант исполнения: в бесконечном цикле запрашивайте вид операции, например, +, - или *
Проверяйте вид операции и запускайте соответствующую команду
Предусмотрите выход из бесконечного цикла
2. Рекурсией.
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def zero_err():
    number2 = int(input('Введите второе число (кроме 0):'))
    if number2 == 0:
        return zero_err()
    return number2


def recursion():
    action = input('Введите операцию (+, -, *, / или 0 для выхода):')
    if action == '0':
        return
    elif action in ('+', '-', '*'):
        number1 = input('Введите первое число:')
        number2 = input('Введите второе число:')
        print(eval(number1 + action + number2))
    elif action == '/':
        number1 = int(input('Введите первое число:'))
        print(number1 /zero_err())
    else:
        print('Ошибка! Введите на выбор +, -, *, / ')
    return recursion()


print(recursion())




