"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Постарайтесь решить задачу двумя способами:
1. Через цикл
Вариант исполнения: в бесконечном цикле запрашивайте вид операции, например, +, - или *
Проверяйте вид операции и запускайте соответствующую команду
Предусмотрите выход из бесконечного цикла
2. Рекурсией.
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ РЕКУРСИЮ
"""


#  Solution from teacher

def calc():
    oper_type = input("Enter type of operation (+,-,*,/ or 0 to quit): ")
    if oper_type == '0':
        return "Exit"

    else:
        if oper_type in "+-*/":
            try:
                num_1 = int(input("Enter the first number: "))
                num_2 = int(input("Enter the second number: "))

                if oper_type == '+':
                    res = num_1 + num_2
                    print(f"You result is {res}")
                    return calc()

                if oper_type == '-':
                    res = num_1 - num_2
                    print(f"You result is {res}")
                    return calc()

                if oper_type == '*':
                    res = num_1 * num_2
                    print(f"You result is {res}")
                    return calc()

                if oper_type == '/':
                    if oper_type != 0:
                        res = num_1 / num_2
                        print(f"You result is {res}")
                    else:
                        print("Dividing by zero is impossible. ")
                    return calc()
            except ValueError:
                print("Wrong value. Try again")
            return calc()
