"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)

ЗДЕСЬ ДОЛЖНА БЫТЬ РЕАЛИЗАЦИЯ ЧЕРЕЗ РЕКУРСИЮ
"""


def recursion(num):
    return (num % 10 % 2 + recursion((num - num % 10) // 10)
            ) if num > 0 else num % 10 % 2


my_number = int(input('Введите натуральное число: '))
odd_number_count = recursion(my_number)
print(
    f'Количество четных и нечетных цифр в числе равно: '
    f'({len(str(my_number)) - odd_number_count}, {odd_number_count})')
