"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple


QNT_COMPANIES = int(input('Введите количество предприятий для расчета прибыли: '))
COMPANIES = []
TOTAL_PROFIT = 0
for i in range(QNT_COMPANIES):
    NAME = input('Введите название предприятия: ')
    PROFIT_1, PROFIT_2, PROFIT_3, PROFIT_4 = map(int, input(
        'через пробел введите прибыль данного предприятия \nза каждый квартал(Всего 4 квартала): ').split(' '))

    COMPANY = namedtuple('COMPANY', 'name profit')
    COM_INFO = COMPANY(
        name= NAME,
        profit= PROFIT_1 + PROFIT_2 + PROFIT_3 + PROFIT_4
    )
    TOTAL_PROFIT += COM_INFO.profit
    COMPANIES.append(COM_INFO)

AVG_PROFIT = TOTAL_PROFIT / QNT_COMPANIES

print(f'Средняя годовая прибыль всех предприятий: {AVG_PROFIT}')
print(f'Предприятия, с прибылью выше среднего значения: {[el.name for el in COMPANIES if el.profit >= AVG_PROFIT]}')
print(f'Предприятия, с прибылью ниже среднего значения: {[el.name for el in COMPANIES if el.profit < AVG_PROFIT]}')
