"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

import collections

enterprise = collections.namedtuple('enterprise', ['x1', 'x2', 'x3', 'x4'])

base_enterprise = {}

count = int(input("Количество предприятий: "))

for i in range(count):
    name = input(str(i+1) + '-е предприятие: ')
    profit_x1 = int(input('Введите прибыль предприятия за 1-й квартал: '))
    profit_x2 = int(input('Введите прибыль предприятия за 2-й квартал: '))
    profit_x3 = int(input('Введите прибыль предприятия за 3-й квартал: '))
    profit_x4 = int(input('Введите прибыль предприятия за 4-й квартал: '))
    base_enterprise[name] = enterprise(
        x1=profit_x1,
        x2=profit_x2,
        x3=profit_x3,
        x4=profit_x4
    )

total_profit = ()

for name, profit in base_enterprise.items():
    print(f'Прибыль предприятия {name}: составила за год - {sum(profit)}')
    total_profit += profit

avg_profit_total = sum(total_profit) / len(base_enterprise)
print(f'Средняя прибыль за год для всех предприятий: {avg_profit_total}')


for name, profit in base_enterprise.items():
    if sum(profit) > avg_profit_total:
        print(f'Предприятие у коготорого прибыль выше среднего: {name}. Прибыль - {sum(profit)}')

for name, profit in base_enterprise.items():
    if sum(profit) < avg_profit_total:
        print(f'Предприятие у коготорого прибыль ниже среднего: {name}. Прибыль - {sum(profit)}')