"""
Задание 6.	Пользователь вводит номер буквы в алфавите.
Определить, какая это буква.

Пример:
Введите номер буквы: 4
Введёному номеру соответствует буква: d

Подсказка: используйте ф-ции chr() и ord()
"""

LETTER = int(input('Введите номер буквы: '))
LETTER = LETTER + 97 - 1
print(chr(LETTER))

