"""
Задание 2. Выполнить логические побитовые операции "И", "ИЛИ"
и др. над числами 5 и 6. Выполнить
над числом 5 побитовый сдвиг вправо и влево на два знака.

Подсказка: это стандартные операции, которые осуществляются с помощью
стандартных операторов. Попробуйте найти каких именно.
"""

"""Логическое И"""
print(5 & 6)

"""Логическое ИЛИ"""
print(5 | 6)

"""Логическое Исключающее ИЛИ"""
print(5 ^ 6)

"""Сдвиг на два бита влево"""
print(5 << 2)

"""Сдвиг на два бита вправо"""
print(5 >> 2)
