"""
Задание 2. Выполнить логические побитовые операции "И", "ИЛИ"
и др. над числами 5 и 6. Выполнить
над числом 5 побитовый сдвиг вправо и влево на два знака.

Подсказка: это стандартные операции, которые осуществляются с помощью
стандартных операторов. Попробуйте найти каких именно.
"""

print(f'побитовое И для 5 и 6: {5 & 6}')
print(f'побитовое ИЛИ для 5 и 6: {5 | 6}')
print(f'побитовsq cдвиг вправо: {5 >> 2}')
print(f'побитовsq cдвиг влево: {5 << 2}')
